#+STARTUP: overview
* Interface tweaks
#+BEGIN_SRC emacs-lisp
(setq inhibit-startup-message t)
(global-display-line-numbers-mode)
(fset 'yes-or-no-p 'y-or-n-p)
(global-set-key (kbd "<f5>") 'revert-buffer)
;; Window-size and font size

(setq default-frame-alist
      '((top . 100) (left . 300)
        (width . 150) (height . 40)))
        ;; (cursor-color . "white")
        ;; (cursor-type . box)
        ;; (foreground-color . "yellow")
        ;; (background-color . "black")
        ;; (font . "-*-Courier-normal-r-*-*-13-*-*-*-c-*-iso8859-1")))
#+END_SRC

#+RESULTS:
: ((top . 100) (left . 300) (width . 150) (height . 40))

